<script setup lang="ts"></script>

<template>
  <div class="home">
    <div class="container">
      Привет, юзернейм... Как ты вообще нашёл это место? А если вместо слова "нашёл" для тебя
      необходимо использовать слово "нашла", то это ещё более удивительно. Однако, не смотря на это,
      ты здесь. А что значит... "здесь"? Что это за место? Что ж... Однозначного ответа на данные
      вопросы у меня нет. Каждый может ответить по-разному. Например, кто-то подумает, что это всего
      лишь какой-то сайт, на котором можно послушать музыку, и в какой-то степени будет прав.
      Однако, у меня есть другое представление. Это место я смело могу назвать "моя душа". Звучит
      глупо, не правда ли? Но это действительно так. Я полностью вложил себя в написание и создание
      этого сайта, а уж тем более этих композиций, которые тебе, скорее всего, предстоит услышать. В
      них, на мой взгляд, ты можешь узнать меня лучше, чем при живом общении. Они полностью передают
      моё настроение, мои мысли и чувства в момент их написания.
    </div>
  </div>
</template>

<style scoped>
.home {
  margin-top: 200px;
  font-size: var(--text-md);
  color: var(--text-color-soft);
  line-height: 1.5;
  text-align: justify;
  text-indent: 32px;
}
</style>
